**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [1]:
import pandas as pd
import numpy as np

data = pd.DataFrame({'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']})
data

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
4  spoonbills  6.0       3       no
5      Cranes  3.0       4       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [2]:
data.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

# 3. Print the first 2 rows of the birds dataframe

In [3]:
data.head(2)

    birds  age  visits priority
0  Cranes  3.5       2      yes
1  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [4]:
data[['birds','age']]

        birds  age
0      Cranes  3.5
1      Cranes  4.0
2     plovers  1.5
3  spoonbills  NaN
4  spoonbills  6.0
5      Cranes  3.0
6     plovers  5.5
7      Cranes  NaN
8  spoonbills  8.0
9  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [5]:
data[['birds','age','visits']].loc[[2,3,7]]

        birds  age  visits
2     plovers  1.5       3
3  spoonbills  NaN       4
7      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [6]:
data[data['visits']<4]

        birds  age  visits priority
0      Cranes  3.5       2      yes
2     plovers  1.5       3       no
4  spoonbills  6.0       3       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [7]:
data[['birds','visits']] [data ['age'].isnull()]

        birds  visits
3  spoonbills       4
7      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [8]:
data[(data['birds'] == 'Cranes') & (data['age'] < 4) ]

    birds  age  visits priority
0  Cranes  3.5       2      yes
5  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [9]:
data[(data['age'] >2) & (data['age']<=4)]

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
5      Cranes  3.0       4       no
9  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [10]:
(data['visits'] [data['birds']=='Cranes']).sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [12]:
print((data['age'] [data['birds']=='Cranes']).mean())
print((data['age'] [data['birds']=='plovers']).mean())
print((data['age'] [data['birds']=='spoonbills']).mean())

3.5
3.5
6.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [13]:
# Adding a new row 'k' to dataframe

k = {'birds':'parrot', 'age': 4 , 'visits': 5 , 'priority': 'yes'}
data= data.append(k , ignore_index = True)
data

/var/folders/6b/2zlt1ymn2k517bv8xcgljcdh0000gn/T/ipykernel_73207/2774846460.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data= data.append(k , ignore_index = True)

         birds  age  visits priority
0       Cranes  3.5       2      yes
1       Cranes  4.0       4      yes
2      plovers  1.5       3       no
3   spoonbills  NaN       4      yes
4   spoonbills  6.0       3       no
5       Cranes  3.0       4       no
6      plovers  5.5       2       no
7       Cranes  NaN       2      yes
8   spoonbills  8.0       3       no
9   spoonbills  4.0       2       no
10      parrot  4.0       5      yes

In [14]:
data = data.drop([10])
data

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
4  spoonbills  6.0       3       no
5      Cranes  3.0       4       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no

**13. Find the number of each type of birds in dataframe (Counts)**

In [15]:
data['birds'].value_counts()

Cranes        4
spoonbills    4
plovers       2
Name: birds, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [17]:
data = data.sort_values(by = "age" , ascending = False)
data.sort_values(by = 'visits')

        birds  age  visits priority
6     plovers  5.5       2       no
9  spoonbills  4.0       2       no
0      Cranes  3.5       2      yes
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
4  spoonbills  6.0       3       no
2     plovers  1.5       3       no
1      Cranes  4.0       4      yes
5      Cranes  3.0       4       no
3  spoonbills  NaN       4      yes

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [ ]:
data["priority"] = data["priority"].map({"yes":1 , "no" :0})
data

        birds  age  visits  priority
6     plovers  5.5       2         0
9  spoonbills  4.0       2         0
0      Cranes  3.5       2         1
7      Cranes  NaN       2         1
8  spoonbills  8.0       3         0
4  spoonbills  6.0       3         0
2     plovers  1.5       3         0
1      Cranes  4.0       4         1
5      Cranes  3.0       4         0
3  spoonbills  NaN       4         1

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [ ]:
data["birds"] = data["birds"].replace({"Cranes" : 'trumpeters'})
data

        birds  age  visits  priority
6     plovers  5.5       2         0
9  spoonbills  4.0       2         0
0  trumpeters  3.5       2         1
7  trumpeters  NaN       2         1
8  spoonbills  8.0       3         0
4  spoonbills  6.0       3         0
2     plovers  1.5       3         0
1  trumpeters  4.0       4         1
5  trumpeters  3.0       4         0
3  spoonbills  NaN       4         1